//;******************************************************************************
//;* Copyright (c) 1983-2015, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
//;
//; Module Name:
//;
//;   Strings.uni
//;
//; Abstract:
//;
//;   String definitions for BdsPlatform formset.
//;
//
//    String definitions for BdsPlatform formset.
//
//  Copyright (c) 2004 - 2010, Intel Corporation. All rights reserved.<BR>
//  This program and the accompanying materials
//  are licensed and made available under the terms and conditions of the BSD License
//  which accompanies this distribution.  The full text of the license may be found at
//  http://opensource.org/licenses/bsd-license.php
//
//  THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
//  WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
//**/

/=#

#include "Standard.uni"

#string STR_INTERNAL_EFI_SHELL         #language en-US  "[Internal EFI Shell]"
                                       #language fr-FR  "[la Coquille interne de EFI]"
#string STR_LEGACY_BOOT_A              #language en-US  "[Internal Legacy Boot A:]"
                                       #language fr-FR  "[Amorce Legacy interne A:]"
#string STR_PROCESSED_ALL_BOOT_OPTIONS #language en-US  "[ProcessedAllBootOptions(): Load shell from the FV]"
                                       #language fr-FR  "[ProcessedAllBootOptions (): shell charge de la FV]"
#string STR_DEFAULT_TIMEOUT_BANNER     #language en-US  "Default boot selection will be booted in "
                                       #language fr-FR  "Sélection de démarrage par défaut sera lancée"
#string STR_SECONDS                    #language en-US  " seconds"
                                       #language fr-FR  " les secondes"
#string STR_EXIT_DATA                  #language en-US  "ExitData: "
                                       #language fr-FR  "ExitData: "
#string STR_LOADING                    #language en-US  "Loading: "
                                       #language fr-FR  "Chargement: "
#string STR_ENTER_NORMAL_BOOT          #language en-US  "Entering Normal Boot Process..."
                                       #language fr-FR  "Saisie processus de démarrage normal..."
#string STR_PERFORM_MEM_TEST           #language en-US  "Perform memory test (DEL to skip)"
                                       #language fr-FR  "Exécute l'examen de mémoire (DEL pour sauter)"
#string STR_MEMORY_TEST_PERCENT        #language en-US  "% of the system memory tested OK"
                                       #language fr-FR  "% de la mémoire de système essayée D'ACCORD"
#string STR_DEL_TO_SKIP_MEM_TEST       #language en-US  "Press DEL key to skip memory test"
                                       #language fr-FR  "Appuie sur DEL sauter examen de mémoire"
#string STR_MEM_TEST_COMPLETED         #language en-US  " bytes of system memory tested OK"
                                       #language fr-FR  " octets dela mémoire de système essayée D'ACCORD"
#string STR_NO_EXT_MEM_FOUND           #language en-US  "Memory resource updated!"
                                       #language fr-FR  "la mémoire Non étendue trouvée!"
#string STR_SYSTEM_MEM_ERROR           #language en-US  "System encounters memory errors"
                                       #language fr-FR  "le Système rencontre les erreurs de mémoire"
//#string STR_START_BOOT_OPTION        #language en-US  "Start boot option"
//                                     #language fr-FR  "l'option de botte de Début"

#string STR_AUTO_FAILOVER_DISABLE_BOOT_FAIL  #language en-US  "Default Boot Device Missing or Boot Failed.\nInsert Recovery Media and Hit any key.\nThen Select 'Boot Manager' to choose a new Boot Device or to Boot Recovery Media"
#string STR_AUTO_FAILOVER_NO_BOOT_DEVICE     #language en-US  "Default Boot Device Missing or Boot Failed.\nInsert Recovery Media and Hit any key \nThen Select 'Boot Manager' to choose a new Boot Device or to Boot Recovery Media"
#string STR_USB_OPTION_INEXISTENCE     #language en-US        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language fr-FR        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language zh-TW        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language ja-JP        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language it-IT        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language es-ES        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language de-DE        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
                                       #language pt-PT        "System doesn't have any USB boot option. Please select other boot option in Boot Manager Menu."
#string STR_CD_OPTION_INEXISTENCE      #language en-US        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language fr-FR        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language zh-TW        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language ja-JP        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language it-IT        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language es-ES        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language de-DE        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
                                       #language pt-PT        "System doesn't have any CD/DVD boot option. Please select other boot option in Boot Manager Menu."
#string STR_NETWORK_OPTION_INEXISTENCE #language en-US        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language fr-FR        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language zh-TW        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language ja-JP        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language it-IT        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language es-ES        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language de-DE        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
                                       #language pt-PT        "System doesn't have any Network boot option. Please select other boot option in Boot Manager Menu or Enable PXE Boot Option in SCU."
#string STR_SELECT_USB_OPTION          #language en-US        "Which USB boot option do you want to select?"
                                       #language fr-FR        "Which USB boot option do you want to select?"
                                       #language zh-TW        "Which USB boot option do you want to select?"
                                       #language ja-JP        "Which USB boot option do you want to select?"
                                       #language it-IT        "Which USB boot option do you want to select?"
                                       #language es-ES        "Which USB boot option do you want to select?"
                                       #language de-DE        "Which USB boot option do you want to select?"
                                       #language pt-PT        "Which USB boot option do you want to select?"
#string STR_SELECT_CD_OPTION           #language en-US        "Which CD/DVD boot option do you want to select?"
                                       #language fr-FR        "Which CD/DVD boot option do you want to select?"
                                       #language zh-TW        "Which CD/DVD boot option do you want to select?"
                                       #language ja-JP        "Which CD/DVD boot option do you want to select?"
                                       #language it-IT        "Which CD/DVD boot option do you want to select?"
                                       #language es-ES        "Which CD/DVD boot option do you want to select?"
                                       #language de-DE        "Which CD/DVD boot option do you want to select?"
                                       #language pt-PT        "Which CD/DVD boot option do you want to select?"
#string STR_SELECT_NETWORK_OPTION      #language en-US        "Which network boot option do you want to select?"
                                       #language fr-FR        "Which network boot option do you want to select?"
                                       #language zh-TW        "Which network boot option do you want to select?"
                                       #language ja-JP        "Which network boot option do you want to select?"
                                       #language it-IT        "Which network boot option do you want to select?"
                                       #language es-ES        "Which network boot option do you want to select?"
                                       #language de-DE        "Which network boot option do you want to select?"
                                       #language pt-PT        "Which network boot option do you want to select?"
#string STR_TIMEOUT_CHANGE             #language en-US        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language fr-FR        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language zh-TW        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language ja-JP        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language it-IT        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language es-ES        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language de-DE        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
                                       #language pt-PT        "The timeout value is %d seconds and it is larger than maximum timeout value %d. Restore timeout variable to %d!!!"
//
// Update "Boot device error string (BDES)" for UEFI and CSM16.
//
#string STR_BOOT_DEVICE_ERROR_MESSAGE  #language en-US  ""
                                       #language fr-FR  ""